{
  "id": "path_seconde",
  "title": "Mathématiques Seconde",
  "description": "Programme complet de mathématiques niveau seconde",
  "chapters": [
    { "id": "chap_ensembles_nombres", "title": "Ensembles de nombres", "description": "Découvre les différents ensembles de nombres : naturels (ℕ), entiers relatifs (ℤ), rationnels (ℚ) et réels (ℝ). Tu apprendras à reconnaître chaque ensemble, à utiliser la notation des intervalles et à comparer des nombres. Ces notions sont fondamentales pour toute ta scolarité en mathématiques !", "icon": "🔢", "order": 1, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_autour_triangle", "title": "Autour du triangle", "description": "Explore les propriétés fascinantes des triangles ! Tu découvriras la somme des angles (toujours 180°), le célèbre théorème de Pythagore pour les triangles rectangles, les médianes, les hauteurs et le calcul de périmètres. Le triangle est partout dans la nature et l'architecture !", "icon": "🔺", "order": 2, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_scratch", "title": "Scratch", "description": "Apprends la programmation de façon visuelle avec Scratch ! Tu vas comprendre les boucles (répéter des actions), les conditions (prendre des décisions), les variables et les déplacements. C'est une introduction ludique à l'algorithmique, une compétence essentielle du 21ème siècle.", "icon": "🐱", "order": 3, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_probabilites", "title": "Probabilités", "description": "Entre dans le monde des probabilités ! Tu apprendras à calculer la chance qu'un événement se produise : lancer de dés, tirage de cartes, billes dans un sac... Les probabilités sont utilisées dans les jeux, la météo, la médecine et bien d'autres domaines. Tu verras que les maths peuvent prédire le hasard !", "icon": "🎲", "order": 4, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_proportionnalite", "title": "Proportionnalité et grandeurs composées", "description": "Maîtrise la proportionnalité, un outil mathématique super pratique au quotidien ! Tu sauras utiliser les tableaux de proportionnalité, calculer des pourcentages (soldes, TVA), résoudre des problèmes de vitesse et adapter des recettes de cuisine. Le produit en croix n'aura plus de secrets pour toi !", "icon": "📊", "order": 5, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_quadrilateres", "title": "Autour des quadrilatères", "description": "Plonge dans l'univers des quadrilatères : carré, rectangle, losange, parallélogramme et trapèze. Tu découvriras leurs propriétés uniques (côtés égaux, angles droits, côtés parallèles), comment calculer leurs périmètres et leurs aires. Ces formes sont partout : fenêtres, terrains de sport, panneaux de signalisation...", "icon": "🟥", "order": 6, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_calcul_litteral", "title": "Calcul littéral et algébrique", "description": "Passe au niveau supérieur avec le calcul littéral ! Tu vas apprendre à manipuler des expressions avec des lettres (variables), à développer et factoriser, à résoudre des équations et à utiliser les identités remarquables. C'est le langage universel des mathématiques qui ouvre la porte à l'algèbre avancée.", "icon": "✏️", "order": 7, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_geometrie_espace", "title": "Géométrie dans l'espace", "description": "Passe à la 3D avec la géométrie dans l'espace ! Découvre les solides : cubes, pavés droits, cylindres, pyramides et cônes. Tu apprendras à calculer leurs volumes, à reconnaître leurs faces, arêtes et sommets, et à visualiser des objets en 3 dimensions. Essentiel pour l'architecture et l'ingénierie !", "icon": "🧊", "order": 8, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_arithmetique", "title": "Arithmétique", "description": "Explore les secrets des nombres entiers avec l'arithmétique ! Tu vas découvrir les critères de divisibilité (par 2, 3, 5, 9...), les nombres premiers, le PGCD (Plus Grand Commun Diviseur) et le PPCM. L'arithmétique est la base de la cryptographie qui sécurise Internet et tes communications !", "icon": "🧮", "order": 9, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_statistiques", "title": "Statistiques", "description": "Apprends à analyser et interpréter des données avec les statistiques ! Tu sauras calculer des moyennes, médianes, étendues et quartiles. Tu découvriras comment les graphiques (diagrammes en barres, histogrammes) permettent de visualiser l'information. Les statistiques sont partout : sondages, météo, sport, économie...", "icon": "📈", "order": 10, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_fonctions", "title": "Fonctions", "description": "Découvre le concept fascinant de fonction mathématique ! Une fonction transforme un nombre en un autre selon une règle. Tu apprendras à calculer des images et antécédents, à distinguer fonctions linéaires et affines, et à interpréter des graphiques. Les fonctions modélisent le monde réel : température, prix, distance...", "icon": "📉", "order": 11, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] },
    { "id": "chap_transformations_plan", "title": "Transformations du plan", "description": "Transforme des figures avec élégance ! Tu vas maîtriser les symétries (effet miroir), les translations (glissement), les rotations (tourner autour d'un point) et les homothéties (agrandissement/réduction). Ces transformations sont utilisées en design, architecture, animations et jeux vidéo. Comprends comment bouger et transformer des formes tout en préservant leurs propriétés !", "icon": "🔁", "order": 12, "isLocked": false, "completionPercentage": 0, "totalQuestions": 0, "completedQuestions": 0, "skillIds": [] }
  ]
}
